/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   parse.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: rtsubuku <rtsubuku@student.42tokyo.jp>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/02/23 08:25:31 by rtsubuku          #+#    #+#             */
/*   Updated: 2026/02/23 08:26:15 by rtsubuku         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// parse.c = 受付（ルールチェック係）

// 「君、名前書いてないよ（引数足りない）」

// 「それ数字じゃないよ」

// 「fifo / edf 以外はダメ」
// みたいに、入力をチェックして正しい形に整える